# 파이썬 타입 
# list, tuple, set 
# 반복 -> for, while 

# 기본타입(원시타입) = primitive type (모듈로 확장하지 않아도 그냥 기본적으로 사용이 가능한 것) import없이 사용할 수 있는 것
# 값1 : int, float, bool, str
# sequence : list, tuple, set, dictionary(자바에서는 map이라고한다.)

# CRUD는 기본이다. 대부분의 사이트의 기본이다.

# 리스트 : 변경가능 -> 다양한 작업을 할 수 있다.
# tuple : 변경불가능 -> read만 가능하다. 한번 만들고나면 읽기만 가능하다

# 보통 속도는 그렇게 차이가 나지 않는다. 근데 서버는 다르다. 서버쪽은 매우 중요하다. 그래서 메모리, 속도가 매우 중요하다. 
# 또한 클라우드를 사용하기 때문에 용량을 줄이면 돈을 줄일 수 있다.

# [1,2,3] = list
# (1,2,3) = tuple
# {1,2,3} = set 숫서가 없다.
# 

"""
dicitonary 

이름과 값(key와 value)의 쌍 => 키(이름) : 값
키를 가지고 값을 찾는다. 
{
    "name" : "홍길동",
    "age" : 20 
}
"""
# 값의 의미를 모르면 divitonary를 사용하면 된다. -> 키를 가지고 불러오면 된다. 
# 값의 의미를 알면 tuple을 사용하는 게 좋다. 

